feat(postinst) add configuration migration from env to config and improve systemd setup
